--- 1 ------------------------------------------------------
-- Вывести адреса объектов недвижимости, у которых стоимость
-- 1 м2 меньше средней стоимости по району
------------------------------------------------------------
---

--- 2 -------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------
SELECT
districts.name, COUNT(*)
FROM
districts, objects, sales
WHERE
objects.district_id = districts.id
AND
sales.object_id = objects.id
GROUP BY
districts.name
HAVING
COUNT(*) > 5;

--- 3 --------------------------------------
-- Вывести адреса квартир и название района,
-- средняя оценка которых выше 3,5 баллов
--------------------------------------------
SELECT
districts.name, objects.address, AVG(rates.rate)
FROM
districts, objects, types, rates
WHERE
objects.district_id = districts.id
AND
objects.type_id = types.id AND types.name = 'Квартира'
AND
objects.id = rates.object_id
GROUP BY
districts.name, objects.address
HAVING
AVG(rates.rate) > 3.5;

--- 4 -----------------------------------
-- Вывести ФИО риэлторов, которые продали
-- меньше 5 объектов недвижимости
-----------------------------------------
SELECT
realtors.s_name, realtors.f_name, realtors.t_name, COUNT(*)
FROM
realtors, sales
WHERE
sales.realtor_id = realtors.id
GROUP BY
realtors.s_name, realtors.f_name, realtors.t_name
HAVING
COUNT(*) < 120;

--- 5 --------------------------------------
-- Определить годы, в которых было размещено
-- от 2 до 3 объектов недвижимости
--------------------------------------------
SELECT
extract(year from objects.date) as year, COUNT(*)
FROM
objects
GROUP BY
year
HAVING
COUNT(*) > 10 AND COUNT(*) < 20
ORDER BY
year;

--- 6 -------------------------------------
-- Определить адреса квартир, стоимость 1м2
-- которых меньше средней по району
-------------------------------------------
---

--- 2 -------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 2 -------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 2 -------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 20 ------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 18 ------------------------------------------
--
--
-------------------------------------------------
WITH "2021" AS (
  SELECT
  district_id, COUNT(*)
	FROM (
    (
      SELECT object_id
      FROM sales
      WHERE EXTRACT(year FROM sales.date) = 2021
    ) as "a"
    JOIN
    (
      SELECT
      objects.id, objects.district_id
      FROM objects
    ) AS "b"
    ON "a".object_id = "b".id
  )
  GROUP BY district_id
),
"2022" AS (
  SELECT district_id, count(*)
  FROM (
    (
      SELECT object_id
      FROM sales
      WHERE EXTRACT(year FROM sales.date) = 2022
    ) AS "a"
    JOIN
    (
      SELECT
      objects.id, objects.district_id
      FROM objects
    ) as "b"
    ON "a".object_id = "b".id
  )
  GROUP BY district_id
)

SELECT
districts.name, "2021".count, "2022".count,
round((("2022".count - "2021".count) / "2022".count::decimal) * 100) AS delta
FROM
"2021", "2022", districts
WHERE
districts.id = "2021".district_id
AND
districts.id = "2022".district_id;
