!УСЛОВИЯ ЗАДАНИЙ НЕ ИЗМЕНЕНЫ! кроме % = 3

--- 1 ------------------------------------------------------
-- Вывести адреса объектов недвижимости, у которых стоимость
-- 1 м2 меньше средней стоимости по району
------------------------------------------------------------


--- 2 -------------------------------------------
-- Вывести название районов, в которых количество
-- проданных квартир больше 5
-------------------------------------------------

--- 3 --------------------------------------
-- Добавить таблицу зп риэлтора.
-- Сделать так, чтобы функция из задания 2 сохраняла
-- зп в этой таблице
--------------------------------------------

--- 4 -----------------------------------
-- Вывести ФИО риэлторов, которые продали
-- меньше 5 объектов недвижимости
-----------------------------------------


--- 5 --------------------------------------
-- Определить годы, в которых было размещено
-- от 2 до 3 объектов недвижимости
--------------------------------------------


--- 6 -------------------------------------
-- Определить адреса квартир, стоимость 1м2
-- которых меньше средней по району
-------------------------------------------

--- 7 ------------------------------
-- Определить ФИО риэлторов, которые
-- ничего не продали в текущем году
------------------------------------

--- 8 ----------------------------------------
-- Вывести названия районов, в которых средняя
-- площадь продаваемых квартир больше 30м2
----------------------------------------------

--- 9 --------------------------------------------------
-- Вывести для указанного риэлтора (ФИО) года, в которых
-- он продал больше 2 объектов недвижимости
--------------------------------------------------------

--- 10 -------------------------------------------------------------
-- Вывести ФИО риэлторов, которые заработали премию в текущем месяце
-- больше 40000 рублей. Премия рассчитываются по формуле:
-- общая стоимость всех проданных квартир * 15%
--------------------------------------------------------------------

--- 11 --------------------------------------------
-- Вывести количество однокомнатных и двухкомнатных
-- квартир в указанном районе
---------------------------------------------------

--- 12 ------------------------------------------------
-- Определить индекс средней оценки по каждому критерию
-- для указанного объекта недвижимости
-------------------------------------------------------

--- 13 ----------------------------------------------------------------
-- Добавить новую таблицу «Структура объекта недвижимости» с колонками:
-- Объект недвижимости, Тип комнаты, Площадь.
-- Установите ограничение-проверку площади, которая должна быть
-- больше нуля и типа комнаты (1, 2, 3, 4), где
-- 1 – кухня, 2 – зал, 3 – спальня, 4 – санузел
-----------------------------------------------------------------------

--- 14 --------------------------------------------------
-- Вывести информацию о комнатах для объекта недвижимости
---------------------------------------------------------

--- 15 -----------------------------------------------------------------------------
-- Вывести количество объектов недвижимости по каждому району, общая площадь которых
-- больше 40 м2. Использовать таблицу «Структура объекта недвижимости»
------------------------------------------------------------------------------------

--- 16 -------------------------------------------------------
-- Используя функции для работы с датой:
-- extract(field from timestamp) и age(timestamp, timestamp),
-- вывести квартиры,которые были проданы
-- не позже 4 месяцев после размещения объявления о их продаже
--------------------------------------------------------------

--- 17 --------------------------------------------------------
-- Вывести адреса объектов недвижимости, стоимость 1м2 которых
-- меньше среднейвсех объектов недвижимости по району,
-- объявления о которых были размещены не более 4 месяцев назад
---------------------------------------------------------------

--- 18 ---------------------------------------------------------
-- Вывести информацию о количество продаж в предыдущем и текущем
-- годах по каждому району, а также процент изменения
----------------------------------------------------------------
